Revit 2026 API

# CeramicType Enumeration

---

The enumerated type representing the permitted values for the asset property "CeramicType" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CeramicType
```
```vb
Public Enumeration CeramicType
```
```cpp
public enum class CeramicType
```
```fsharp
type CeramicType
```

| Member name | Value | Description |
| --- | --- | --- |
| Ceramic | 0 |  |
| Porcelain | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace